// 1. while, поки цикл виконується, будемо робити якісь дії
let num = 50;
// while (num <= 55) {
//     console.log(num);
//     num++;
// }

// 2. do, спочатку щось зробити, а потім перевірити умови
// do {
//     console.log(num);
//     num++;
// }

// while (num < 55);

// 3. for, найпопулярніший, адже його можна детально налаштувати
for (let i = 1; i <= 10; i++) {
    if (i === 6) {
        // break; перериває цикл
        continue;
        // пропускає обраний пункт
    }
    console.log(i);
}